Revit 2024 API
Ceiling Class
 Represents a ceiling in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class Ceiling : CeilingAndFloor
Visual Basic
Public Class Ceiling _
	Inherits CeilingAndFloor
Visual C++
public ref class Ceiling : public CeilingAndFloor
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Ceiling
See Also
Ceiling Members
Autodesk.Revit.DB Namespace